data_generation/simulation_results/case_7/constant/simParams
nIter 2000;
hComponent0 2232.3454909046923;
hComponent1 3761.619280367635;
hComponent2 915.573496282487;
hComponent3 3103.0420322106534;
hComponent4 2301.2921480531204;kComponent0 43.25049676205005;
kComponent1 38.32468851007076;
kComponent2 29.099270991813505;
kComponent3 19.676334583242816;
kComponent4 18.00819735709506;
tAmbient 300;
Ux 0.8763063226646737;
kPCB 0.25122795541796417;